{
    "compliance": "<strong>Compliance:</strong><br>Helhetlig vurdering av compliance management i organisasjonen. Oppfølging av avvik fra LT systematisk, internrevisjoner versus compliance monitoring programme.<br>Blir organisasjonen regelmessig revidert av andre eksterne aktører? (IOSA, sub-contractors etc.)",
    "flightops": "<strong>Flight Operations:</strong><br>Kvalifikasjoner og bemanning. Flygesjef, støttepersonell. (sjefsflygere, tekniske piloter, baser etc.) Supervision, line check.<br>Rekruttering, kompetanse og kvalifikasjonskrav.<br>Regelverksendringer, ivaretas dette på god måte?<br>Planlegging; nye ruter, kategorisering av lufthavner, GH avtaler etc.",
    "safety": "<strong>Safety Department:</strong><br>Tilstrekkelig med ressurser? Vurdering av safety avdelingen. Safety mål og policy. Realistiske SPI som evalueres fortløpende?<br>Måles effekten av mitigerende tiltak? Hazard og risk-register.<br>Blir årsaksfaktorer analysert for hendelser med moderat og høy risiko? Er safety barrierer for vesentlig risiko tydelig definert?<br>Blir operasjonelle eller organisatoriske endringer gjenstand for risikovurdering eller analyse i forkant?<br>Er SMS trening for relevant personell utført og systematisert?<br>Er kommunikasjonskanal for safety kritisk informasjon etablert og virksom?",
    "training": "<strong>Training:</strong><br>Bemanning, NPCT og støtte funksjoner.<br>Fixed wing: CC trening.<br>Standardisering av instruktører.<br>Treningsprogram, gir det ønsket utbytte. Tas line check og supervision med i evalueringen.",
    "planning": "<strong>Planning & FTL:</strong><br>Slingekombinasjoner, FRM og løpende vurderinger. Fatigue rapporter.",
    "reporting": "<strong>Reporting:</strong><br>Tilgjengeligheten for alt personell.<br>Just culture prinsipper. Safety kultur.<br>Oppfølging og feedback til rapportør.",
    "other": "<strong>Other:</strong><br>Kort helhetlig vurdering av operatøren. Hvis en 36 måneders syklus skal vurderes eller ikke, skal dette beskrives her."
}